LX3JL/msp430f2619-pac/msp430f2619.svd
        <register>
          <name>TBCCTL1</name>
          <description>Timer B Capture/Compare Control 1</description>
          <addressOffset>102</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>Capture/compare interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COV</name>
              <description>Capture/compare overflow flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT</name>
              <description>PWM Output signal if output mode 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCI</name>
              <description>Capture input signal (read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIE</name>
              <description>Capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>Output mode 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <description>PWM output mode: 0 - output only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <description>PWM output mode: 1 - set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <description>PWM output mode: 4 - toggle</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <description>PWM output mode: 5 - Reset</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture mode: 1 /Compare mode : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLLD</name>
              <description>Compare latch load source 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <description>Compare latch load sourec : 0 - immediate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <description>Compare latch load sourec : 2 - up/down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Capture sychronize</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIS</name>
              <description>Capture input select 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <description>Capture input select: 0 - CCIxA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <description>Capture input select: 1 - CCIxB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <description>Capture input select: 2 - GND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <description>Capture input select: 3 - Vcc</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Capture mode 1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <description>Capture mode: 0 - disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <description>Capture mode: 1 - pos. edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <description>Capture mode: 1 - neg. edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <description>Capture mode: 1 - both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TBCCTL2</name>
          <description>Timer B Capture/Compare Control 2</description>
          <addressOffset>104</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>Capture/compare interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COV</name>
              <description>Capture/compare overflow flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT</name>
              <description>PWM Output signal if output mode 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCI</name>
              <description>Capture input signal (read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIE</name>
              <description>Capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>Output mode 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <description>PWM output mode: 0 - output only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <description>PWM output mode: 1 - set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <description>PWM output mode: 4 - toggle</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <description>PWM output mode: 5 - Reset</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture mode: 1 /Compare mode : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLLD</name>
              <description>Compare latch load source 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <description>Compare latch load sourec : 0 - immediate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <description>Compare latch load sourec : 2 - up/down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Capture sychronize</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIS</name>
              <description>Capture input select 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <description>Capture input select: 0 - CCIxA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <description>Capture input select: 1 - CCIxB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <description>Capture input select: 2 - GND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <description>Capture input select: 3 - Vcc</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Capture mode 1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <description>Capture mode: 0 - disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <description>Capture mode: 1 - pos. edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <description>Capture mode: 1 - neg. edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <description>Capture mode: 1 - both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>TBCCTL3</name>
          <description>Timer B Capture/Compare Control 3</description>
          <addressOffset>106</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CCIFG</name>
              <description>Capture/compare interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>COV</name>
              <description>Capture/compare overflow flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUT</name>
              <description>PWM Output signal if output mode 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCI</name>
              <description>Capture input signal (read)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIE</name>
              <description>Capture/compare interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OUTMOD</name>
              <description>Output mode 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OUTMOD_0</name>
                  <description>PWM output mode: 0 - output only</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_1</name>
                  <description>PWM output mode: 1 - set</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_2</name>
                  <description>PWM output mode: 2 - PWM toggle/reset</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_3</name>
                  <description>PWM output mode: 3 - PWM set/reset</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_4</name>
                  <description>PWM output mode: 4 - toggle</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_5</name>
                  <description>PWM output mode: 5 - Reset</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_6</name>
                  <description>PWM output mode: 6 - PWM toggle/set</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OUTMOD_7</name>
                  <description>PWM output mode: 7 - PWM reset/set</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAP</name>
              <description>Capture mode: 1 /Compare mode : 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CLLD</name>
              <description>Compare latch load source 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CLLD_0</name>
                  <description>Compare latch load sourec : 0 - immediate</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_1</name>
                  <description>Compare latch load sourec : 1 - TBR counts to 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_2</name>
                  <description>Compare latch load sourec : 2 - up/down</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLLD_3</name>
                  <description>Compare latch load sourec : 3 - TBR counts to TBCTL0</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SCS</name>
              <description>Capture sychronize</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CCIS</name>
              <description>Capture input select 1</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CCIS_0</name>
                  <description>Capture input select: 0 - CCIxA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_1</name>
                  <description>Capture input select: 1 - CCIxB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_2</name>
                  <description>Capture input select: 2 - GND</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CCIS_3</name>
                  <description>Capture input select: 3 - Vcc</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CM</name>
              <description>Capture mode 1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CM_0</name>
                  <description>Capture mode: 0 - disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_1</name>
                  <description>Capture mode: 1 - pos. edge</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_2</name>
                  <description>Capture mode: 1 - neg. edge</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CM_3</name>
                  <description>Capture mode: 1 - both edges</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
