LX3JL/msp430f2619-pac/msp430f2619.svd
        <register>
          <name>TBCCR1</name>
          <description>Timer B Capture/Compare 1</description>
          <addressOffset>118</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TBCCR2</name>
          <description>Timer B Capture/Compare 2</description>
          <addressOffset>120</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TBCCR3</name>
          <description>Timer B Capture/Compare 3</description>
          <addressOffset>122</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TBCCR4</name>
          <description>Timer B Capture/Compare 4</description>
          <addressOffset>124</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TBCCR5</name>
          <description>Timer B Capture/Compare 5</description>
          <addressOffset>126</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>TBCCR6</name>
          <description>Timer B Capture/Compare 6</description>
          <addressOffset>128</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>WATCHDOG_TIMER</name>
      <description>Watchdog Timer</description>
      <baseAddress>288</baseAddress>
      <registers>
        <register>
          <name>WDTCTL</name>
          <description>Watchdog Timer Control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTIS0</name>
              <description>WDTIS0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTIS1</name>
              <description>WDTIS1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTSSEL</name>
              <description>WDTSSEL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>WDTCNTCL</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>WDTTMSEL</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTNMI</name>
              <description>WDTNMI</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTNMIES</name>
              <description>WDTNMIES</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>WDTHOLD</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>DMA</name>
      <description>DMA</description>
      <baseAddress>290</baseAddress>
      <registers>
        <register>
          <name>DMACTL0</name>
          <description>DMA Module Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DMA0TSEL</name>
              <description>DMA channel 0 transfer select bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA0TSEL_0</name>
                  <description>DMA channel 0 transfer select 0:  DMA_REQ (sw)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_1</name>
                  <description>DMA channel 0 transfer select 1:  Timer_A (TACCR2.IFG)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_2</name>
                  <description>DMA channel 0 transfer select 2:  Timer_B (TBCCR2.IFG)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_3</name>
                  <description>DMA channel 0 transfer select 3:  USCIA0 receive</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_4</name>
                  <description>DMA channel 0 transfer select 4:  USCIA0 transmit</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_5</name>
                  <description>DMA channel 0 transfer select 5:  DAC12_0CTL.DAC12IFG</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_6</name>
                  <description>DMA channel 0 transfer select 6:  ADC12 (ADC12IFG)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_7</name>
                  <description>DMA channel 0 transfer select 7:  Timer_A (TACCR0.IFG)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_8</name>
                  <description>DMA channel 0 transfer select 8:  Timer_B (TBCCR0.IFG)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_9</name>
                  <description>DMA channel 0 transfer select 9:  USCIA1 receive</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_10</name>
                  <description>DMA channel 0 transfer select 10: USCIA1 transmit</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_11</name>
                  <description>DMA channel 0 transfer select 11: Multiplier ready</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_12</name>
                  <description>DMA channel 0 transfer select 12: USCIB0 receive</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_13</name>
                  <description>DMA channel 0 transfer select 13: USCIB0 transmit</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_14</name>
                  <description>DMA channel 0 transfer select 14: previous DMA channel DMA2IFG</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA0TSEL_15</name>
                  <description>DMA channel 0 transfer select 15: ext. Trigger (DMAE0)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA1TSEL</name>
              <description>DMA channel 1 transfer select bit 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA1TSEL_0</name>
                  <description>DMA channel 1 transfer select 0:  DMA_REQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_1</name>
                  <description>DMA channel 1 transfer select 1:  Timer_A CCRIFG.2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_2</name>
                  <description>DMA channel 1 transfer select 2:  Timer_B CCRIFG.2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_3</name>
                  <description>DMA channel 1 transfer select 3:  USCIA0 receive</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_4</name>
                  <description>DMA channel 1 transfer select 4:  USCIA0 transmit</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_5</name>
                  <description>DMA channel 1 transfer select 5:  DAC12.0IFG</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_6</name>
                  <description>DMA channel 1 transfer select 6:  ADC12 (ADC12IFG)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_7</name>
                  <description>DMA channel 1 transfer select 7:  Timer_A (TACCR0.IFG)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_8</name>
                  <description>DMA channel 1 transfer select 8:  Timer_B (TBCCR0.IFG)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_9</name>
                  <description>DMA channel 1 transfer select 9:  USCIA1 receive</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_10</name>
                  <description>DMA channel 1 transfer select 10: USCIA1 transmit</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_11</name>
                  <description>DMA channel 1 transfer select 11: Multiplier ready</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_12</name>
                  <description>DMA channel 1 transfer select 12: USCIB0 receive</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_13</name>
                  <description>DMA channel 1 transfer select 13: USCIB0 transmit</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_14</name>
                  <description>DMA channel 1 transfer select 14: previous DMA channel DMA0IFG</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA1TSEL_15</name>
                  <description>DMA channel 1 transfer select 15: ext. Trigger (DMAE0)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2TSEL</name>
              <description>DMA channel 2 transfer select bit 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DMA2TSEL_0</name>
                  <description>DMA channel 2 transfer select 0:  DMA_REQ</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_1</name>
                  <description>DMA channel 2 transfer select 1:  Timer_A CCRIFG.2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_2</name>
                  <description>DMA channel 2 transfer select 2:  Timer_B CCRIFG.2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_3</name>
                  <description>DMA channel 2 transfer select 3:  USCIA0 receive</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_4</name>
                  <description>DMA channel 2 transfer select 4:  USCIA0 transmit</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_5</name>
                  <description>DMA channel 2 transfer select 5:  DAC12.0IFG</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_6</name>
                  <description>DMA channel 2 transfer select 6:  ADC12 (ADC12IFG)</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_7</name>
                  <description>DMA channel 2 transfer select 7:  Timer_A (TACCR0.IFG)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_8</name>
                  <description>DMA channel 2 transfer select 8:  Timer_B (TBCCR0.IFG)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_9</name>
                  <description>DMA channel 2 transfer select 9:  USCIA1 receive</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_10</name>
                  <description>DMA channel 2 transfer select 10: USCIA1 transmit</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_11</name>
                  <description>DMA channel 2 transfer select 11: Multiplier ready</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_12</name>
                  <description>DMA channel 2 transfer select 12: USCIB0 receive</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_13</name>
                  <description>DMA channel 2 transfer select 13: USCIB0 transmit</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_14</name>
                  <description>DMA channel 2 transfer select 14: previous DMA channel DMA1IFG</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DMA2TSEL_15</name>
                  <description>DMA channel 2 transfer select 15: ext. Trigger (DMAE0)</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>DMACTL1</name>
          <description>DMA Module Control 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ENNMI</name>
              <description>Enable NMI interruption of DMA</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ROUNDROBIN</name>
              <description>Round-Robin DMA channel priorities</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMAONFETCH</name>
              <description>DMA transfer on instruction fetch</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DMAIV</name>
          <description>DMA Interrupt Vector Word</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
