LX3JL/msp430f2619-pac/msp430f2619.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65472</baseAddress>
      <interrupt>
        <name>RESERVED0</name>
        <description>0xFFC0 Reserved Int. Vector 0</description>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>RESERVED1</name>
        <description>0xFFC2 Reserved Int. Vector 1</description>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>RESERVED2</name>
        <description>0xFFC4 Reserved Int. Vector 2</description>
        <value>2</value>
      </interrupt>
      <interrupt>
        <name>RESERVED3</name>
        <description>0xFFC6 Reserved Int. Vector 3</description>
        <value>3</value>
      </interrupt>
      <interrupt>
        <name>RESERVED4</name>
        <description>0xFFC8 Reserved Int. Vector 4</description>
        <value>4</value>
      </interrupt>
      <interrupt>
        <name>RESERVED5</name>
        <description>0xFFCA Reserved Int. Vector 5</description>
        <value>5</value>
      </interrupt>
      <interrupt>
        <name>RESERVED6</name>
        <description>0xFFCC Reserved Int. Vector 6</description>
        <value>6</value>
      </interrupt>
      <interrupt>
        <name>RESERVED7</name>
        <description>0xFFCE Reserved Int. Vector 7</description>
        <value>7</value>
      </interrupt>
      <interrupt>
        <name>RESERVED8</name>
        <description>0xFFD0 Reserved Int. Vector 8</description>
        <value>8</value>
      </interrupt>
      <interrupt>
        <name>RESERVED9</name>
        <description>0xFFD2 Reserved Int. Vector 9</description>
        <value>9</value>
      </interrupt>
      <interrupt>
        <name>RESERVED10</name>
        <description>0xFFD4 Reserved Int. Vector 10</description>
        <value>10</value>
      </interrupt>
      <interrupt>
        <name>RESERVED11</name>
        <description>0xFFD6 Reserved Int. Vector 11</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>RESERVED12</name>
        <description>0xFFD8 Reserved Int. Vector 12</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>RESERVED13</name>
        <description>0xFFDA Reserved Int. Vector 13</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>DAC12</name>
        <description>0xFFDC DAC12</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>DMA</name>
        <description>0xFFDE DMA</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>USCIAB1TX</name>
        <description>0xFFE0 USCI A1/B1 Transmit</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>USCIAB1RX</name>
        <description>0xFFE2 USCI A1/B1 Receive</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFE4 Port 1</description>
        <value>18</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFE6 Port 2</description>
        <value>19</value>
      </interrupt>
      <interrupt>
        <name>RESERVED20</name>
        <description>0xFFE8 Reserved Int. Vector 20</description>
        <value>20</value>
      </interrupt>
      <interrupt>
        <name>ADC12</name>
        <description>0xFFEA ADC</description>
        <value>21</value>
      </interrupt>
      <interrupt>
        <name>USCIAB0TX</name>
        <description>0xFFEC USCI A0/B0 Transmit</description>
        <value>22</value>
      </interrupt>
      <interrupt>
        <name>USCIAB0RX</name>
        <description>0xFFEE USCI A0/B0 Receive</description>
        <value>23</value>
      </interrupt>
      <interrupt>
        <name>TIMERA1</name>
        <description>0xFFF0 Timer A CC1-2, TA</description>
        <value>24</value>
      </interrupt>
      <interrupt>
        <name>TIMERA0</name>
        <description>0xFFF2 Timer A CC0</description>
        <value>25</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFF4 Watchdog Timer</description>
        <value>26</value>
      </interrupt>
      <interrupt>
        <name>COMPARATORA</name>
        <description>0xFFF6 Comparator A</description>
        <value>27</value>
      </interrupt>
      <interrupt>
        <name>TIMERB1</name>
        <description>0xFFF8 Timer B CC1-6, TB</description>
        <value>28</value>
      </interrupt>
      <interrupt>
        <name>TIMERB0</name>
        <description>0xFFFA Timer B CC0</description>
        <value>29</value>
      </interrupt>
      <interrupt>
        <name>NMI</name>
        <description>0xFFFC Non-maskable</description>
        <value>30</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
